src/DataProcessors/ВыдачаТранзита/ВыдачаТранзита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыдачаТранзита</name>
</mdclass:DataProcessor>

src/Documents/ДвижениеТранзита/ДвижениеТранзита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвижениеТранзита</name>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>AccumulationRegister.Возвраты</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОпераций_ДвижениеТранзита</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПокупкиТранзит</name>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Посылки</types>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.Движение</types>
        <types>DocumentRef.ФормированиеКоробки</types>
        <types>DocumentRef.КорректировкаЗаписейРегистров</types>
        <types>DocumentRef.Приходная</types>
        <types>DocumentRef.РазборКоробки</types>
        <types>DocumentRef.ОтправлениеТранзита</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГабаритНазначение</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХраненияНазначение</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачиНазначение</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.Организаторы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачиТранзита</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/ВыдачаТранзита/Forms/СостоянияЗаказовПоПунктамВыдачи/Module.bsl
&НаКлиенте
Процедура НачатьОтгрузку(Команда)
	ПунктВыдачи = Элементы.СостоянияОтгрузки.ТекущиеДанные.ПунктВыдачи;
	УстановитьСостояниеОтгрузки(ПунктВыдачи, Истина);
	Элементы.СостоянияОтгрузки.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьВыдачуТранзита(Команда)
	ПунктВыдачи = Элементы.СостоянияОтгрузки.ТекущиеДанные.ПунктВыдачи;
	
    ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияформыДокумента",ЭтаФорма);	
	ОткрытьФорму(	"Обработка.ВыдачаТранзита.Форма.НеПодтвержденныеПосылки",
					новый Структура("ИсточникВызова, ПунктВыдачи","ВыдачаТранзита",ПунктВыдачи),
					ЭтаФорма,Истина,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДвижениеТранзита(Команда)
		ПунктВыдачи 		= Элементы.СостоянияОтгрузки.ТекущиеДанные.ПунктВыдачи;
		ПараметрыЗаполнения	= Новый Структура();
		ПараметрыЗаполнения.Вставить("Дата", 		ТекущаяДата());
		ПараметрыЗаполнения.Вставить("ВидОперации", "ТранзитНаТранзит");
		ПараметрыЗаполнения.Вставить("БуфенаяЗона", новый структура("ПравоеЗначение, Использование, ВидСравнения",Истина, Истина, ВидСравненияКомпоновкиДанных.Равно) );
		ПараметрыЗаполнения.Вставить("Точка", 		новый структура("ПравоеЗначение, Использование", ПунктВыдачи, Истина) );
	
    	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияформыДокумента",ЭтаФорма);
	
		ОткрытьФорму("Документ.ДвижениеТранзита.ФормаОбъекта",Новый структура("ПараметрыЗаполнения",ПараметрыЗаполнения) ,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс  );

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияформыДокумента(Результат, ДопПараметры) Экспорт
	Элементы.СостоянияОтгрузки.Обновить();
КонецПроцедуры


&НаСервере
Процедура СформироватьВыдачуТранзитаНаСервере()

КонецПроцедуры


&НаКлиенте
Процедура ЗавершитьОтгрузку(Команда)
	ПунктВыдачи = Элементы.СостоянияОтгрузки.ТекущиеДанные.ПунктВыдачи;
	УстановитьСостояниеОтгрузки(ПунктВыдачи,Ложь);
	Элементы.СостоянияОтгрузки.Обновить();
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеОтгрузки(ПунктВыдачи, ПроизводитсяОтгрузка)
	ПВ = ПунктВыдачи.ПолучитьОбъект();
	ПВ.ПроизводитсяОтгрузка = ПроизводитсяОтгрузка;
	Попытка
		ПВ.Записать();
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
КонецПроцедуры


Процедура ОтключениеНовогоПоискаВСписках(Форма)
	
//	Список = Форма.Элементы.Найти("СостоянияОтгрузки");
//	Если Список = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Список.ПоложениеСтрокиПоиска = ПоложениеСтрокиПоиска.Нет;
//	
//	ДополнениеСтрокаПоиска = Форма.Элементы.Найти("ДополнениеСтрокаПоиска");
//	Если НЕ ДополнениеСтрокаПоиска = Неопределено Тогда
//		ДополнениеСтрокаПоиска.Видимость = Ложь;
//	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтключениеНовогоПоискаВСписках(ЭтаФорма);
КонецПроцедуры
